var hotelScatterContainer = document.getElementById('hotel-scatter');

//用于使chart自适应高度和宽度,通过窗体高宽计算容器高宽
function resizehotelScatterContainer () {
    hotelScatterContainer.style.width = (window.innerWidth * 0.5 - 20) + 'px';
    hotelScatterContainer.style.height = (window.innerHeight * 0.5 - 12) + 'px';
}
//设置容器高宽
resizehotelScatterContainer();

var hotelScatterChart = echarts.init(hotelScatterContainer);
    
var hoteldata = [[[176693, 555, 29308044, '密云风景区']], [[728677, 393, 217428789, '中关村/五道口']], [[749799, 314, 164659249, '前门/天坛']], [[606973, 302, 129492336, '劲松/潘家园/宋家庄']], [[294829, 290, 45820931, '房山风景区']], [[597442, 279, 138175862, '小汤山温泉度假区']], [[701038, 276, 147048919, '永定门/北京南站/大红门']], [[381342, 270, 122671564, '国贸CBD/四惠']], [[456310, 268, 87945320, '果园环岛/通州区']], [[578051, 263, 187760269, '西直门/动物园']], [[546948, 260, 126197149, '总部地区/丰南体育馆地区']], [[443983, 252, 86727988, '大兴农业生态观光区']], [[531925, 251, 151537776, '公主坟/五棵松/石景山游乐园地区']], [[625751, 243, 159747173, '北京西站/丽泽商务区']], [[414417, 234, 150071945, '西单/金融街']], [[433560, 222, 94496907, '首都机场/新国展']], [[112766, 207, 18797331, '怀柔区']], [[418345, 192, 135983306, '亚运村/奥体中心']], [[57583, 190, 9427109, '十渡风景名胜区周边']], [[357467, 187, 82948335, '亦庄地区']], [[241730, 178, 108187904, '工体/三里屯/东直门']], [[72356, 158, 14060137, '延庆旅游度假区']], [[273932, 158, 56049048, '十三陵水库/居庸关长城风景区']], [[361125, 150, 133265860, '天安门/王府井']], [[279882, 142, 84488354, '北京站/建国门']], [[199404, 131, 68470707, '望京']], [[248216, 128, 56654461, '顺义温泉休闲区']], [[242388, 121, 72514460, '马甸/安贞']], [[238873, 119, 60540537, '南锣鼓巷']], [[337867, 116, 111029475, '上地产业园/西三旗']], [[240069, 100, 50773790, '传媒大学/管庄']], [[237545, 98, 62259197, '老国展/三元桥']], [[29559, 95, 4778070, '八达岭古长城附近']], [[165001, 85, 52768392, '燕莎/亮马桥/朝阳公园']], [[75566, 84, 12085462, '平谷城区']], [[14481, 71, 1599482, '龙庆峡风景区周边']], [[113756, 70, 26234423, '香山/八大处风景区']], [[32483, 67, 8460025, '门头沟/潭柘寺/妙峰山风景区']], [[17646, 65, 4142385, '怀柔慕田峪/红螺寺']], [[79616, 60, 18493358, '鼓楼/后海']], [[14721, 55, 5403152, '古北水镇周边']], [[9600, 51, 3871112, '怀柔虹鳟鱼一条沟/神堂峪']], [[2259, 46, 500934, '密云区']], [[93412, 43, 35479979, '酒仙桥/798']], [[8266, 41, 3419670, '怀柔雁栖湖风景区']], [[15387, 34, 11078977, '古北水镇']], [[125089, 33, 23788045, '欢乐谷游乐区']], [[75234, 26, 14019799, '南苑']], [[4346, 26, 346419, '京东石林峡风景区']]]


var hotelLegend = ['密云风景区', '中关村/五道口', '前门/天坛', '劲松/潘家园/宋家庄', '房山风景区', '小汤山温泉度假区', '永定门/北京南站/大红门', '国贸CBD/四惠', '果园环岛/通州区', '西直门/动物园', '总部地区/丰南体育馆地区', '大兴农业生态观光区', '公主坟/五棵松/石景山游乐园地区', '北京西站/丽泽商务区', '西单/金融街', '首都机场/新国展', '怀柔区', '亚运村/奥体中心', '十渡风景名胜区周边', '亦庄地区', '工体/三里屯/东直门', '延庆旅游度假区', '十三陵水库/居庸关长城风景区', '天安门/王府井', '北京站/建国门', '望京', '顺义温泉休闲区', '马甸/安贞', '南锣鼓巷', '上地产业园/西三旗', '传媒大学/管庄', '老国展/三元桥', '八达岭古长城附近', '燕莎/亮马桥/朝阳公园', '平谷城区', '龙庆峡风景区周边', '香山/八大处风景区', '门头沟/潭柘寺/妙峰山风景区', '怀柔慕田峪/红螺寺', '鼓楼/后海', '古北水镇周边', '怀柔虹鳟鱼一条沟/神堂峪', '密云区', '酒仙桥/798', '怀柔雁栖湖风景区', '古北水镇', '欢乐谷游乐区', '南苑', '京东石林峡风景区']


var hotelScatteroption = {
    // backgroundColor: '#031f2d',
    title: {
        text: '商圈/景点消费分布散点图',
        x: 'center',
        y:'0%',
        textStyle: {
                color: '#fff',
                fontSize: '16'
            }
    },
    color: [
      '#0580F2',
      '#FAA732',
      '#E1575D',
      '#8B73CC',
      '#8CD123',
      '#4B53BA',
      '#429588',
      '#ff3333', 'orange', 'yellow','lime','aqua'
    ],
    tooltip: {
        trigger: "item",
        "axisLine": {
            lineStyle: {
                color: '#90979c'
            }
        },
        "axisPointer": {
            "type": "shadow",
            textStyle: {
                color: "#fff"
            },
        
        },
        formatter: function (params) {
            return params.value[3]+'<br/>数量：'+params.value[1]
                    +'<br/>消费人数：'+params.value[0]
                    +'<br/>消费额：'+params.value[2]+'元';
            //return params.value[0];// + ' : ' + params.value[2];
          
        }
    },
    // legend: {
    //   icon: 'circle',
    //   bottom: '0%',
    //   itemWidth: 12,
    //   itemHeight: 12,
    //   data: beijingLegend,
    //   textStyle:{
    //     color: '#90979c'

    //   },
    //},
    grid: {
      top:"10%",
      left: '0%',
      right: '9.5%',
      bottom: '5%',
      containLabel: true
    },
    xAxis: {
      "axisLine": {
          lineStyle: {
              color: '#90979c'
          }
      },
      splitLine: {
          lineStyle: {
              type: 'dashed'
          }
      },
      name :'数量',
    },
    yAxis: {
      "axisLine": {
              lineStyle: {
                  color: '#90979c'
              }
          },
      splitLine: {
          lineStyle: {
              type: 'dashed'
          }
      },
      scale: true,
      name :'消费人数',
    },
    series: hotelLegend.map((v, i) => {
      return {
        name: v,
        data: hoteldata[i],
        type: 'scatter',
        symbolSize: function(data) {
          return Math.sqrt(data[2]) / 500
        },
        label: {
          normal: {
            show: false,
            formatter: function(param) {
              return param.data[3]
            },
            position: 'top'
          },
          emphasis: {
            show: true,
            formatter: function(param) {
              return param.data[3]
            },
            position: 'top'
          }
        },
        itemStyle: {
          normal: {
            shadowBlur: 10,
            shadowColor: 'rgba(120, 36, 50, 0.5)',
            shadowOffsetY: 5
          }
        }
      }
    })
};
hotelScatterChart.setOption(hotelScatteroption);  
